_notes/_posts/technology/2023-03-17-cppcoreguidelines-es9.org
#+layout: post
#+title: CppCoreGuidelines ES.9 避免全大写的命名
#+categories: technology
#+tags: CppCoreGuidelines

[[http://kimi.im/tags.html#CppCoreGuidelines-ref][C++ 核心指南目录]]

"Avoid ~ALL_CAPS~ names"


理由

这类命名通常是宏。因此全大写的命名可能会不小心被宏替换掉。

例子

#+begin_src C++ :exports both :flags -std=c++20 :namespaces std :includes  <iostream> <vector> <algorithm> :eval no-export :results output
// somewhere in some header:
#define NE !=

// somewhere else in some other header:
enum Coord { N, NE, NW, S, SE, SW, E, W };

// somewhere third in some poor programmer's .cpp:
switch (direction) {
case N:
    // ...
case NE:
    // ...
// ...
}
#+end_src

注意

不要因为习惯用宏来定义常量而把常量写成全大写的。


标注所有使用全大写的命名。对于老的代码，可以接受全大写的宏。对于不是宏
的全大写命名，需要特别标注。
