_posts/technology/2023-03-17-cppcoreguidelines-es9.html
---
layout: post
title: CppCoreGuidelines ES.9 避免全大写的命名
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Avoid <code>ALL_CAPS</code> names&rdquo;
</p>


<p>
理由
</p>

<p>
这类命名通常是宏。因此全大写的命名可能会不小心被宏替换掉。
</p>

<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">somewhere in some header:</span>
<span style="color: #7F0055; font-weight: bold;">#define</span> <span style="color: #000000;">NE</span> !=

<span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">somewhere else in some other header:</span>
<span style="color: #7F0055; font-weight: bold;">enum</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Coord</span> <span style="color: #707183;">{</span> <span style="color: #000000;">N</span>, <span style="color: #000000;">NE</span>, <span style="color: #000000;">NW</span>, <span style="color: #000000;">S</span>, <span style="color: #000000;">SE</span>, <span style="color: #000000;">SW</span>, <span style="color: #000000;">E</span>, <span style="color: #000000;">W</span> <span style="color: #707183;">}</span>;

<span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">somewhere third in some poor programmer's .cpp:</span>
<span style="color: #7F0055; font-weight: bold;">switch</span> <span style="color: #707183;">(</span>direction<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
<span style="color: #7F0055; font-weight: bold;">case</span> N:
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #7F0055; font-weight: bold;">case</span> NE:
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
注意
</p>

<p>
不要因为习惯用宏来定义常量而把常量写成全大写的。
</p>


<p>
标注所有使用全大写的命名。对于老的代码，可以接受全大写的宏。对于不是宏的全大写命名，需要特别标注。
</p>
